app/Controllers/Auth.php

INSERT INTO `users` (`username`, `email`, `password`, `role`, `created_at`, `updated_at`) VALUES ('boy', 'boy@gmail.com', '$2y$10$hFvBFlx5ju6h/dwBSrr2BO9caixhKujqLh7DkL8A/INXG.1Jz7a6W', 'student', '2025-09-24 04:22:05', '2025-09-24 04:22:05')
---
    public function register()
    {
        // Handle POST request (registration submission)
        if ($this->request->getMethod() === 'POST') {
            $userModel = new UserModel();

            $rules = [
                'name' => 'required|min_length[3]',
                'email' => 'required|valid_email|is_unique[users.email]',
                'password' => 'required|min_length[6]',
                'password_confirm' => 'required|matches[password]',
            ];

            if (!$this->validate($rules)) {
                return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
            }

            // Prepare user data
            $userData = [
                'username' => $this->request->getPost('name'),
                'email' => $this->request->getPost('email'),
                'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
                'role' => 'student' // Default role based on your existing database
            ];

            // Save user data
            try {
                if ($userModel->save($userData)) {

SELECT *
FROM `users`
WHERE `email` = 'student1@example.com'
 LIMIT 1
---
    public function login()
    {
        // Handle POST request (login submission)
        if ($this->request->getMethod() === 'POST') {
            $session = session();
            $userModel = new UserModel();

            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            // Validation rules
            $rules = [
                'email' => 'required|valid_email',
                'password' => 'required'
            ];

            if (!$this->validate($rules)) {
                return redirect()->back()->withInput()->with('error', 'Please provide valid email and password.');
            }

            try {
                // Find user by email
                $user = $userModel->where('email', $email)->first();

SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'student'
SELECT *
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 5
---
        // Fetch role-specific data
        switch ($userRole) {
            case 'admin':
                $data['totalUsers'] = $userModel->countAll();
                $data['totalAdmins'] = $userModel->where('role', 'admin')->countAllResults();
                $data['totalTeachers'] = $userModel->where('role', 'teacher')->countAllResults();
                $data['totalStudents'] = $userModel->where('role', 'student')->countAllResults();
                $data['recentUsers'] = $userModel->orderBy('created_at', 'DESC')->limit(5)->find();