app/Controllers/Course.php

        $courseModel = new CourseModel();
        $enrollmentModel = new EnrollmentModel();

        $course = $courseModel->find($courseId);
---
SELECT *
FROM `courses`
WHERE `courses`.`id` = '16'