app/Controllers/Materials.php

SELECT *
FROM `courses`
WHERE `courses`.`id` = '12'
---
    public function view($courseId)
    {
        $session = session();

        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Please login first.');
        }

        $courseModel = new CourseModel();
        $materialModel = new MaterialModel();

        $course = $courseModel->find($courseId);