app/Controllers/Users.php

    public function index()
    {
        // Check if user is logged in and is admin
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'admin') {
            return redirect()->to('/login')->with('error', 'Access denied. Admin only.');
        }

        // Get all active users (not deleted)
        $data['users'] = $this->userModel->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL

    public function edit($id = null)
    {
        // Check if user is logged in and is admin
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'admin') {
            return redirect()->to('/login')->with('error', 'Access denied. Admin only.');
        }

        if ($id === null) {
            return redirect()->to('/users')->with('error', 'User ID is required.');
        }

        $user = $this->userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '19'