app/Models/EnrollmentModel.php

INSERT INTO `enrollments` (`student_id`, `course_id`, `enrolled_at`) VALUES ('17', '16', '2025-10-08 11:33:34')
---
    public function enrollUser($data)
    {
        return $this->insert($data);

SELECT *
FROM `enrollments`
WHERE `user_id` = '1'
AND `course_id` = '12'
 LIMIT 1
---
    public function isAlreadyEnrolled($userId, $courseId)
    {
        return $this->where(['user_id' => $userId, 'course_id' => $courseId])->first() !== null;