app/Models/EnrollmentModel.php

SELECT *
FROM `enrollments`
WHERE `student_id` = '17'
AND `course_id` = '16'
 LIMIT 1
---
    public function isAlreadyEnrolled($userId, $courseId)
    {
        return $this->where(['student_id' => $userId, 'course_id' => $courseId])->first() !== null;