app/Models/MaterialModel.php

SELECT *
FROM `materials`
WHERE `course_id` = '12'
ORDER BY `created_at` DESC
---
    public function getMaterialsByCourse($courseId)
    {
        return $this->where('course_id', $courseId)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();